ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/device/TMPM066.h
/**
  * @brief Port G
  */
typedef struct {
    __IO uint32_t DATA;     /*!< PG Data Register                             */
    __IO uint32_t CR;       /*!< PG Control Register                          */
    __IO uint32_t FR1;      /*!< PG Function Register 1                       */
    uint32_t RESERVED0[7];
    __IO uint32_t OD;       /*!< PG Open Drain Control Register               */
    __IO uint32_t PUP;      /*!< PG Pull-up Control Register                  */
    __IO uint32_t PDN;      /*!< PG Pull-Down Control Register                */
    __IO uint32_t SEL;      /*!< PG input voltage selection Register          */
    __IO uint32_t IE;       /*!< PG Input Enable Control Register             */
} TSB_PG_TypeDef;

/**
  * @brief Port H
  */
typedef struct {
    __IO uint32_t DATA;     /*!< PH Data Register                             */
    __IO uint32_t CR;       /*!< PH Control Register                          */
    __IO uint32_t FR1;      /*!< PF Function Register 1                       */
    uint32_t RESERVED0[7];
    __IO uint32_t OD;       /*!< PH Open Drain Control Register               */
    __IO uint32_t PUP;      /*!< PH Pull-up Control Register                  */
    __IO uint32_t PDN;      /*!< PH Pull-Down Control Register                */
    uint32_t RESERVED1;
    __IO uint32_t IE;       /*!< PH Input Enable Control Register             */
} TSB_PH_TypeDef;

/**
  * @brief Port J
  */
typedef struct {
    __IO uint32_t DATA;     /*!< PJ Data Register                             */
    __IO uint32_t CR;       /*!< PJ Control Register                          */
    __IO uint32_t FR1;      /*!< PJ Function Register 1                       */
    uint32_t RESERVED0[7];
    __IO uint32_t OD;       /*!< PJ Open Drain Control Register               */
    __IO uint32_t PUP;      /*!< PJ Pull-up Control Register                  */
    __IO uint32_t PDN;      /*!< PJ Pull-Down Control Register                */
    uint32_t RESERVED1;
    __IO uint32_t IE;       /*!< PJ Input Enable Control Register             */
} TSB_PJ_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct {
    __IO uint32_t EN;       /*!< TB Enable Register                           */
    __IO uint32_t RUN;      /*!< TB RUN Register                              */
    __IO uint32_t CR;       /*!< TB Control Register                          */
    __IO uint32_t MOD;      /*!< TB Mode Register                             */
    __IO uint32_t FFCR;     /*!< TB Flip-Flop Control Register                */
    __I uint32_t ST;        /*!< TB Status Register                           */
    __IO uint32_t IM;       /*!< TB Interrupt Mask Register                   */
    __I uint32_t UC;        /*!< TB Read Capture Register                     */
    __IO uint32_t RG0;      /*!< TB RG0 Timer Register                        */
    __IO uint32_t RG1;      /*!< TB RG1 Timer Register                        */
    __I uint32_t CP0;       /*!< TB CP0 Capture Register                      */
    __I uint32_t CP1;       /*!< TB CP1 Capture Register                      */
    __IO uint32_t DMA;      /*!< TB DMA Enable Register                       */
} TSB_TB_TypeDef;

/**
  * @brief SC
  */
typedef struct {
    __IO uint32_t EN;       /*!< SC Enable Register                           */
    __IO uint32_t BUF;      /*!< SC Buffer Register                           */
    __IO uint32_t CR;       /*!< SC Control Register                          */
    __IO uint32_t MOD0;     /*!< SC Mode Control Register 0                   */
    __IO uint32_t BRCR;     /*!< SC Baud Rate Generator Control Register      */
    __IO uint32_t BRADD;    /*!< SC Baud Rate Generator Control Register 2    */
    __IO uint32_t MOD1;     /*!< SC Mode Control Register 1                   */
    __IO uint32_t MOD2;     /*!< SC Mode Control Register 2                   */
    __IO uint32_t RFC;      /*!< SC RX FIFO Configuration Register            */
    __IO uint32_t TFC;      /*!< SC TX FIFO Configuration Register            */
    __I uint32_t RST;       /*!< SC RX FIFO Status Register                   */
    __I uint32_t TST;       /*!< SC TX FIFO Status Register                   */
    __IO uint32_t FCNF;     /*!< SC FIFO Configuration Register               */
    __IO uint32_t DMA;      /*!< SC DMA Request Register                      */
} TSB_SC_TypeDef;

/**
  * @brief WDT
  */
typedef struct {
    __IO uint32_t MOD;      /*!< WD Mode Register                             */
    __O uint32_t CR;        /*!< WD Control Register                          */
    __I uint32_t FLG;       /*!< WD Flag Register                             */
} TSB_WD_TypeDef;

/**
  * @brief CG
  */
typedef struct {
    __IO uint32_t PROTECT;  /*!< Protect Register                             */
    __IO uint32_t OSCCR;    /*!< Oscillation Control Register                 */
    __IO uint32_t SYSCR;    /*!< System clock control register                */
    __IO uint32_t STBYCR;   /*!< Standby Control Register                     */
    uint32_t RESERVED0[4];
    __IO uint32_t PLL0SEL;  /*!< PLL select register for fsys                 */
    uint32_t RESERVED1[3];
    __IO uint32_t WUPHCR;   /*!< Warmup register for HOSC                     */
    uint32_t RESERVED2[7];
    __IO uint32_t FSYSENA;  /*!< output control register A  for fsys clock    */
    __O uint32_t FSYSENB;   /*!< output control register B  for fsys clock    */
    uint32_t RESERVED3;
    __IO uint32_t SPCLKEN;  /*!< Output control register for ADC and TRACE CLOCK */
    __IO uint32_t EXTENDO0; /*!< Optional Function setting Register           */
} TSB_CG_TypeDef;

/**
  * @brief LVD
  */
typedef struct {
    __IO uint32_t CR0;      /*!< LVD Control register0                        */
    __IO uint32_t CR1;      /*!< LVD Control register1                        */
} TSB_LVD_TypeDef;

/**
  * @brief SD Area register1
  */
typedef struct {
    uint8_t RESERVED0[16];
    __IO uint8_t STOP1INT_016;      /*!< STOP1INT(NMI_LVD) I/F Control Register in SD Area */
    __IO uint8_t STOP1INT_017;      /*!< STOP1INT(NMI_LVD) I/F Control Register in SD Area */
    __IO uint8_t IDLEINT_018;       /*!< ILDEINT(NMI_WDT) I/F Control Register in SD Area */
    uint8_t RESERVED1[77];
    __IO uint8_t IDLEINT_096;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_097;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_098;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_099;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_100;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_101;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_102;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_103;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_104;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_105;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_106;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_107;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_108;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_109;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_110;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_111;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_112;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_113;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_114;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_115;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_116;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_117;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_118;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_119;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_120;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_121;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_122;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_123;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_124;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_125;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_126;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_127;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_128;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_129;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_130;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_131;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_132;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_133;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_134;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_135;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_136;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_137;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_138;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_139;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_140;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_141;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_142;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_143;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_144;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_145;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_146;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_147;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_148;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_149;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_150;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_151;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_152;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_153;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_154;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_155;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_156;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_157;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_158;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_159;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_160;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_161;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_162;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_163;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_164;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_165;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_166;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_167;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_168;       /*!< IDLEINT I/F Control Register in SD Area      */
    __IO uint8_t IDLEINT_169;       /*!< IDLEINT I/F Control Register in SD Area      */
    uint32_t RESERVED2[21];
    __I uint32_t FLAG0;     /*!< NMI interrupt status flag register           */
    __I uint32_t FLAG1;     /*!< interrupt status flag register1 for AO area  */
    uint32_t RESERVED3;
    __I uint32_t FLAG3;     /*!< interrupt status flag register3 for SD area  */
    __I uint32_t FLAG4;     /*!< interrupt status flag register4 for SD area  */
    __I uint32_t FLAG5;     /*!< interrupt status flag register5 for SD area  */
} TSB_INTIFSD_TypeDef;

/**
  * @brief ADC
  */
typedef struct {
    __IO uint32_t CLK;      /*!< AD Conversion Clock Setting Register         */
    __IO uint32_t MOD0;     /*!< AD Mode Control Register 0                   */
    __IO uint32_t MOD1;     /*!< AD Mode Control Register 1                   */
    __IO uint32_t MOD2;     /*!< AD Mode Control Register 2                   */
    __IO uint32_t MOD3;     /*!< AD Mode Control Register 3                   */
    __IO uint32_t MOD4;     /*!< AD Mode Control Register 4                   */
    __IO uint32_t MOD5;     /*!< AD Mode Control Register 5                   */
    __IO uint32_t MOD6;     /*!< AD Mode Control Register 6                   */
    uint32_t RESERVED0[4];
    __I uint32_t REG0;      /*!< AD Conversion Result Register 0              */
    __I uint32_t REG1;      /*!< AD Conversion Result Register 1              */
    __I uint32_t REG2;      /*!< AD Conversion Result Register 2              */
    __I uint32_t REG3;      /*!< AD Conversion Result Register 3              */
    __I uint32_t REG4;      /*!< AD Conversion Result Register 4              */
    __I uint32_t REG5;      /*!< AD Conversion Result Register 5              */
    __I uint32_t REG6;      /*!< AD Conversion Result Register 6              */
    __I uint32_t REG7;      /*!< AD Conversion Result Register 7              */
    uint32_t RESERVED1[4];
    __I uint32_t REGSP;     /*!< AD Conversion Result Register SP             */
    __IO uint32_t CMP0;     /*!< AD Conversion Result comparing register0     */
    __IO uint32_t CMP1;     /*!< AD Conversion result comparing register1     */
} TSB_AD_TypeDef;

/**
  * @brief FC
  */
typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t SECBIT;   /*!< FC Security Bit Register                     */
    uint32_t RESERVED1[3];
    __I uint32_t SR;        /*!< FC Flash Status Register                     */
    uint32_t RESERVED2[3];
    __I uint32_t PSRA;      /*!< FC Protect status register                   */
    uint32_t RESERVED3;
    __IO uint32_t PMRA;     /*!< FC Protect Mask register                     */
} TSB_FC_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


