ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/device/TMPM066.h
/* AO Area register2 */
#define TSB_AOREG_RSTFLG_PORF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AOREG->RSTFLG,0)))
#define TSB_AOREG_RSTFLG_PINRSTF                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AOREG->RSTFLG,3)))
#define TSB_AOREG_RSTFLG_LVDRSTF                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AOREG->RSTFLG,5)))
#define TSB_AOREG_RSTFLG1_SYSRSTF                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_AOREG->RSTFLG1,0)))
#define TSB_AOREG_RSTFLG1_WDTRSTF                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_AOREG->RSTFLG1,2)))


/* I2C Wakeup I/F register */
#define TSB_I2CS_WUPCR1_INTEND                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR1,0)))
#define TSB_I2CS_WUPCR1_GC                        (*((uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR1,1)))
#define TSB_I2CS_WUPCR1_RW                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR1,3)))
#define TSB_I2CS_WUPCR1_I2RES                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR1,4)))
#define TSB_I2CS_WUPCR1_ACK                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR1,5)))
#define TSB_I2CS_WUPCR1_SGCDI                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR1,6)))
#define TSB_I2CS_WUPCR1_BUSY                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR1,7)))
#define TSB_I2CS_WUPCR3_WUPSA2EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR3,0)))
#define TSB_I2CS_WUPSL_WUPSA                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPSL,1)))
#define TSB_I2CS_WUPSL_WUPSA2                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPSL,2)))


/* DMA Controller */
#define TSB_DMA_STATUS_MASTER_ENABLE              (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMA->STATUS,0)))
#define TSB_DMA_CFG_MASTER_ENABLE                 (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMA->CFG,0)))
#define TSB_DMA_ERRCLR_ERR_CLR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMA->ERRCLR,0)))


/* Timer D (Unit0) */
#define TSB_TD0_RUN_TDRUN                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_TD0->RUN,0)))
#define TSB_TD0_CR_TDRDE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->CR,2)))
#define TSB_TD0_CR_TDMDPT00                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->CR,4)))
#define TSB_TD0_CR_TDMDPT01                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->CR,8)))
#define TSB_TD0_MOD_TDCLE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->MOD,4)))
#define TSB_TD0_MOD_TDIV0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->MOD,6)))
#define TSB_TD0_MOD_TDIV1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->MOD,7)))
#define TSB_TD0_DMA_DMAEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->DMA,0)))
#define TSB_TD0_RG2_DIR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->RG2,31)))
#define TSB_TD0_RG4_DIR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->RG4,31)))
#define TSB_TD0_HSWB0_OUTV0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->HSWB0,2)))
#define TSB_TD0_HSWB1_OUTV1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD0->HSWB1,2)))
#define TSB_TD0_CP2_DIR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD0->CP2,31)))
#define TSB_TD0_CP4_DIR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD0->CP4,31)))
#define TSB_TD0_HSW0_OUTV0                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD0->HSW0,2)))
#define TSB_TD0_HSW1_OUTV1                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD0->HSW1,2)))


/* Timer D common */
#define TSB_TD_BCR_TDSFT00                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->BCR,0)))
#define TSB_TD_BCR_TDSFT01                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->BCR,1)))
#define TSB_TD_BCR_TDSFT10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->BCR,2)))
#define TSB_TD_BCR_TDSFT11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->BCR,3)))
#define TSB_TD_BCR_PHSCHG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->BCR,4)))
#define TSB_TD_EN_TDHALT                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->EN,5)))
#define TSB_TD_EN_TDEN0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->EN,6)))
#define TSB_TD_EN_TDEN1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD->EN,7)))


/* Timer D (Unit1) */
#define TSB_TD1_RG2_DIR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->RG2,31)))
#define TSB_TD1_RG4_DIR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->RG4,31)))
#define TSB_TD1_HSWB0_OUTV0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->HSWB0,2)))
#define TSB_TD1_HSWB1_OUTV1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->HSWB1,2)))
#define TSB_TD1_RUN_TDRUN                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_TD1->RUN,0)))
#define TSB_TD1_CR_TDRDE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->CR,2)))
#define TSB_TD1_CR_TDMDPT10                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->CR,4)))
#define TSB_TD1_CR_TDMDPT11                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->CR,8)))
#define TSB_TD1_MOD_TDCLE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->MOD,4)))
#define TSB_TD1_MOD_TDIV0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->MOD,6)))
#define TSB_TD1_MOD_TDIV1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->MOD,7)))
#define TSB_TD1_DMA_DMAEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TD1->DMA,0)))
#define TSB_TD1_CP2_DIR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD1->CP2,31)))
#define TSB_TD1_CP4_DIR                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD1->CP4,31)))
#define TSB_TD1_HSW0_OUTV0                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD1->HSW0,2)))
#define TSB_TD1_HSW1_OUTV1                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_TD1->HSW1,2)))


/* 16-bit TimerA */
#define TSB_T16A0_EN_HALT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_T16A0->EN,1)))
#define TSB_T16A0_RUN_RUN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_T16A0->RUN,0)))
#define TSB_T16A0_CR_CLK                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_T16A0->CR,0)))
#define TSB_T16A0_CR_FFEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_T16A0->CR,7)))

