ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/device/TMPM066.h
/* SD Area register1 */
#define TSB_INTIFSD_STOP1INT_016_INT016EN         (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_016,0)))
#define TSB_INTIFSD_STOP1INT_016_INT016PFLG       (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_016,4)))
#define TSB_INTIFSD_STOP1INT_016_INT016NFLG       (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_016,5)))
#define TSB_INTIFSD_STOP1INT_016_INT016PCLR       (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_016,6)))
#define TSB_INTIFSD_STOP1INT_016_INT016NCLR       (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_016,7)))
#define TSB_INTIFSD_STOP1INT_017_INT017EN         (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_017,0)))
#define TSB_INTIFSD_STOP1INT_017_INT017PFLG       (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_017,4)))
#define TSB_INTIFSD_STOP1INT_017_INT017NFLG       (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_017,5)))
#define TSB_INTIFSD_STOP1INT_017_INT017PCLR       (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_017,6)))
#define TSB_INTIFSD_STOP1INT_017_INT017NCLR       (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->STOP1INT_017,7)))
#define TSB_INTIFSD_IDLEINT_018_INT018EN          (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_018,0)))
#define TSB_INTIFSD_IDLEINT_018_INT018PFLG        (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_018,4)))
#define TSB_INTIFSD_IDLEINT_018_INT018NFLG        (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_018,5)))
#define TSB_INTIFSD_IDLEINT_018_INT018PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_018,6)))
#define TSB_INTIFSD_IDLEINT_018_INT018NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_018,7)))
#define TSB_INTIFSD_IDLEINT_096_INT096EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_096,0)))
#define TSB_INTIFSD_IDLEINT_096_INT096PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_096,4)))
#define TSB_INTIFSD_IDLEINT_096_INT096NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_096,5)))
#define TSB_INTIFSD_IDLEINT_096_INT096PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_096,6)))
#define TSB_INTIFSD_IDLEINT_096_INT096NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_096,7)))
#define TSB_INTIFSD_IDLEINT_097_INT097EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_097,0)))
#define TSB_INTIFSD_IDLEINT_097_INT097PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_097,4)))
#define TSB_INTIFSD_IDLEINT_097_INT097NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_097,5)))
#define TSB_INTIFSD_IDLEINT_097_INT097PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_097,6)))
#define TSB_INTIFSD_IDLEINT_097_INT097NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_097,7)))
#define TSB_INTIFSD_IDLEINT_098_INT098EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_098,0)))
#define TSB_INTIFSD_IDLEINT_098_INT098PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_098,4)))
#define TSB_INTIFSD_IDLEINT_098_INT098NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_098,5)))
#define TSB_INTIFSD_IDLEINT_098_INT098PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_098,6)))
#define TSB_INTIFSD_IDLEINT_098_INT098NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_098,7)))
#define TSB_INTIFSD_IDLEINT_099_INT099EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_099,0)))
#define TSB_INTIFSD_IDLEINT_099_INT099PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_099,4)))
#define TSB_INTIFSD_IDLEINT_099_INT099NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_099,5)))
#define TSB_INTIFSD_IDLEINT_099_INT099PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_099,6)))
#define TSB_INTIFSD_IDLEINT_099_INT099NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_099,7)))
#define TSB_INTIFSD_IDLEINT_100_INT100EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_100,0)))
#define TSB_INTIFSD_IDLEINT_100_INT100PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_100,4)))
#define TSB_INTIFSD_IDLEINT_100_INT100NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_100,5)))
#define TSB_INTIFSD_IDLEINT_100_INT100PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_100,6)))
#define TSB_INTIFSD_IDLEINT_100_INT100NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_100,7)))
#define TSB_INTIFSD_IDLEINT_101_INT101EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_101,0)))
#define TSB_INTIFSD_IDLEINT_101_INT101PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_101,4)))
#define TSB_INTIFSD_IDLEINT_101_INT101NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_101,5)))
#define TSB_INTIFSD_IDLEINT_101_INT101PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_101,6)))
#define TSB_INTIFSD_IDLEINT_101_INT101NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_101,7)))
#define TSB_INTIFSD_IDLEINT_102_INT102EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_102,0)))
#define TSB_INTIFSD_IDLEINT_102_INT102PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_102,4)))
#define TSB_INTIFSD_IDLEINT_102_INT102NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_102,5)))
#define TSB_INTIFSD_IDLEINT_102_INT102PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_102,6)))
#define TSB_INTIFSD_IDLEINT_102_INT102NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_102,7)))
#define TSB_INTIFSD_IDLEINT_103_INT103EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_103,0)))
#define TSB_INTIFSD_IDLEINT_103_INT103PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_103,4)))
#define TSB_INTIFSD_IDLEINT_103_INT103NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_103,5)))
#define TSB_INTIFSD_IDLEINT_103_INT103PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_103,6)))
#define TSB_INTIFSD_IDLEINT_103_INT103NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_103,7)))
#define TSB_INTIFSD_IDLEINT_104_INT104EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_104,0)))
#define TSB_INTIFSD_IDLEINT_104_INT104PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_104,4)))
#define TSB_INTIFSD_IDLEINT_104_INT104NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_104,5)))
#define TSB_INTIFSD_IDLEINT_104_INT104PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_104,6)))
#define TSB_INTIFSD_IDLEINT_104_INT104NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_104,7)))
#define TSB_INTIFSD_IDLEINT_105_INT105EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_105,0)))
#define TSB_INTIFSD_IDLEINT_105_INT105PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_105,4)))
#define TSB_INTIFSD_IDLEINT_105_INT105NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_105,5)))
#define TSB_INTIFSD_IDLEINT_105_INT105PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_105,6)))
#define TSB_INTIFSD_IDLEINT_105_INT105NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_105,7)))
#define TSB_INTIFSD_IDLEINT_106_INT106EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_106,0)))
#define TSB_INTIFSD_IDLEINT_106_INT106PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_106,4)))
#define TSB_INTIFSD_IDLEINT_106_INT106NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_106,5)))
#define TSB_INTIFSD_IDLEINT_106_INT106PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_106,6)))
#define TSB_INTIFSD_IDLEINT_106_INT106NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_106,7)))
#define TSB_INTIFSD_IDLEINT_107_INT107EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_107,0)))
#define TSB_INTIFSD_IDLEINT_107_INT107PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_107,4)))
#define TSB_INTIFSD_IDLEINT_107_INT107NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_107,5)))
#define TSB_INTIFSD_IDLEINT_107_INT107PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_107,6)))
#define TSB_INTIFSD_IDLEINT_107_INT107NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_107,7)))
#define TSB_INTIFSD_IDLEINT_108_INT108EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_108,0)))
#define TSB_INTIFSD_IDLEINT_108_INT108PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_108,4)))
#define TSB_INTIFSD_IDLEINT_108_INT108NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_108,5)))
#define TSB_INTIFSD_IDLEINT_108_INT108PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_108,6)))
#define TSB_INTIFSD_IDLEINT_108_INT108NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_108,7)))
#define TSB_INTIFSD_IDLEINT_109_INT109EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_109,0)))
#define TSB_INTIFSD_IDLEINT_109_INT109PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_109,4)))
#define TSB_INTIFSD_IDLEINT_109_INT109NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_109,5)))
#define TSB_INTIFSD_IDLEINT_109_INT109PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_109,6)))
#define TSB_INTIFSD_IDLEINT_109_INT109NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_109,7)))
#define TSB_INTIFSD_IDLEINT_110_INT110EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_110,0)))
#define TSB_INTIFSD_IDLEINT_110_INT110PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_110,4)))
#define TSB_INTIFSD_IDLEINT_110_INT110NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_110,5)))
#define TSB_INTIFSD_IDLEINT_110_INT110PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_110,6)))
#define TSB_INTIFSD_IDLEINT_110_INT110NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_110,7)))
#define TSB_INTIFSD_IDLEINT_111_INT111EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_111,0)))
#define TSB_INTIFSD_IDLEINT_111_INT111PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_111,4)))
#define TSB_INTIFSD_IDLEINT_111_INT111NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_111,5)))
#define TSB_INTIFSD_IDLEINT_111_INT111PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_111,6)))
#define TSB_INTIFSD_IDLEINT_111_INT111NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_111,7)))
#define TSB_INTIFSD_IDLEINT_112_INT112EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_112,0)))
#define TSB_INTIFSD_IDLEINT_112_INT112PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_112,4)))
#define TSB_INTIFSD_IDLEINT_112_INT112NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_112,5)))
#define TSB_INTIFSD_IDLEINT_112_INT112PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_112,6)))
#define TSB_INTIFSD_IDLEINT_112_INT112NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_112,7)))
#define TSB_INTIFSD_IDLEINT_113_INT113EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_113,0)))
#define TSB_INTIFSD_IDLEINT_113_INT113PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_113,4)))
#define TSB_INTIFSD_IDLEINT_113_INT113NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_113,5)))
#define TSB_INTIFSD_IDLEINT_113_INT113PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_113,6)))
#define TSB_INTIFSD_IDLEINT_113_INT113NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_113,7)))
#define TSB_INTIFSD_IDLEINT_114_INT114EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_114,0)))
#define TSB_INTIFSD_IDLEINT_114_INT114PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_114,4)))
#define TSB_INTIFSD_IDLEINT_114_INT114NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_114,5)))
#define TSB_INTIFSD_IDLEINT_114_INT114PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_114,6)))
#define TSB_INTIFSD_IDLEINT_114_INT114NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_114,7)))
#define TSB_INTIFSD_IDLEINT_115_INT115EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_115,0)))
#define TSB_INTIFSD_IDLEINT_115_INT115PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_115,4)))
#define TSB_INTIFSD_IDLEINT_115_INT115NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_115,5)))
#define TSB_INTIFSD_IDLEINT_115_INT115PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_115,6)))
#define TSB_INTIFSD_IDLEINT_115_INT115NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_115,7)))
#define TSB_INTIFSD_IDLEINT_116_INT116EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_116,0)))
#define TSB_INTIFSD_IDLEINT_116_INT116PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_116,4)))
#define TSB_INTIFSD_IDLEINT_116_INT116NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_116,5)))
#define TSB_INTIFSD_IDLEINT_116_INT116PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_116,6)))
#define TSB_INTIFSD_IDLEINT_116_INT116NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_116,7)))
#define TSB_INTIFSD_IDLEINT_117_INT117EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_117,0)))
#define TSB_INTIFSD_IDLEINT_117_INT117PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_117,4)))
#define TSB_INTIFSD_IDLEINT_117_INT117NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_117,5)))
#define TSB_INTIFSD_IDLEINT_117_INT117PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_117,6)))
#define TSB_INTIFSD_IDLEINT_117_INT117NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_117,7)))
#define TSB_INTIFSD_IDLEINT_118_INT118EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_118,0)))
#define TSB_INTIFSD_IDLEINT_118_INT118PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_118,4)))
#define TSB_INTIFSD_IDLEINT_118_INT118NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_118,5)))
#define TSB_INTIFSD_IDLEINT_118_INT118PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_118,6)))
#define TSB_INTIFSD_IDLEINT_118_INT118NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_118,7)))
#define TSB_INTIFSD_IDLEINT_119_INT119EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_119,0)))
#define TSB_INTIFSD_IDLEINT_119_INT119PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_119,4)))
#define TSB_INTIFSD_IDLEINT_119_INT119NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_119,5)))
#define TSB_INTIFSD_IDLEINT_119_INT119PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_119,6)))
#define TSB_INTIFSD_IDLEINT_119_INT119NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_119,7)))
#define TSB_INTIFSD_IDLEINT_120_INT120EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_120,0)))
#define TSB_INTIFSD_IDLEINT_120_INT120PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_120,4)))
#define TSB_INTIFSD_IDLEINT_120_INT120NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_120,5)))
#define TSB_INTIFSD_IDLEINT_120_INT120PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_120,6)))
#define TSB_INTIFSD_IDLEINT_120_INT120NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_120,7)))
#define TSB_INTIFSD_IDLEINT_121_INT121EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_121,0)))
#define TSB_INTIFSD_IDLEINT_121_INT121PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_121,4)))
#define TSB_INTIFSD_IDLEINT_121_INT121NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_121,5)))
#define TSB_INTIFSD_IDLEINT_121_INT121PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_121,6)))
#define TSB_INTIFSD_IDLEINT_121_INT121NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_121,7)))
#define TSB_INTIFSD_IDLEINT_122_INT122EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_122,0)))
#define TSB_INTIFSD_IDLEINT_122_INT122PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_122,4)))
#define TSB_INTIFSD_IDLEINT_122_INT122NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_122,5)))
#define TSB_INTIFSD_IDLEINT_122_INT122PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_122,6)))
#define TSB_INTIFSD_IDLEINT_122_INT122NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_122,7)))
#define TSB_INTIFSD_IDLEINT_123_INT123EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_123,0)))
#define TSB_INTIFSD_IDLEINT_123_INT123PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_123,4)))
#define TSB_INTIFSD_IDLEINT_123_INT123NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_123,5)))
#define TSB_INTIFSD_IDLEINT_123_INT123PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_123,6)))
#define TSB_INTIFSD_IDLEINT_123_INT123NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_123,7)))
#define TSB_INTIFSD_IDLEINT_124_INT124EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_124,0)))
#define TSB_INTIFSD_IDLEINT_124_INT124PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_124,4)))
#define TSB_INTIFSD_IDLEINT_124_INT124NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_124,5)))
#define TSB_INTIFSD_IDLEINT_124_INT124PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_124,6)))
#define TSB_INTIFSD_IDLEINT_124_INT124NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_124,7)))
#define TSB_INTIFSD_IDLEINT_125_INT125EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_125,0)))
#define TSB_INTIFSD_IDLEINT_125_INT125PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_125,4)))
#define TSB_INTIFSD_IDLEINT_125_INT125NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_125,5)))
#define TSB_INTIFSD_IDLEINT_125_INT125PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_125,6)))
#define TSB_INTIFSD_IDLEINT_125_INT125NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_125,7)))
#define TSB_INTIFSD_IDLEINT_126_INT126EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_126,0)))
#define TSB_INTIFSD_IDLEINT_126_INT126PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_126,4)))
#define TSB_INTIFSD_IDLEINT_126_INT126NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_126,5)))
#define TSB_INTIFSD_IDLEINT_126_INT126PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_126,6)))
#define TSB_INTIFSD_IDLEINT_126_INT126NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_126,7)))
#define TSB_INTIFSD_IDLEINT_127_INT127EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_127,0)))
#define TSB_INTIFSD_IDLEINT_127_INT127PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_127,4)))
#define TSB_INTIFSD_IDLEINT_127_INT127NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_127,5)))
#define TSB_INTIFSD_IDLEINT_127_INT127PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_127,6)))
#define TSB_INTIFSD_IDLEINT_127_INT127NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_127,7)))
#define TSB_INTIFSD_IDLEINT_128_INT128EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_128,0)))
#define TSB_INTIFSD_IDLEINT_128_INT128PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_128,4)))
#define TSB_INTIFSD_IDLEINT_128_INT128NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_128,5)))
#define TSB_INTIFSD_IDLEINT_128_INT128PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_128,6)))
#define TSB_INTIFSD_IDLEINT_128_INT128NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_128,7)))
#define TSB_INTIFSD_IDLEINT_129_INT129EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_129,0)))
#define TSB_INTIFSD_IDLEINT_129_INT129PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_129,4)))
#define TSB_INTIFSD_IDLEINT_129_INT129NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_129,5)))
#define TSB_INTIFSD_IDLEINT_129_INT129PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_129,6)))
#define TSB_INTIFSD_IDLEINT_129_INT129NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_129,7)))
#define TSB_INTIFSD_IDLEINT_130_INT130EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_130,0)))
#define TSB_INTIFSD_IDLEINT_130_INT130PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_130,4)))
#define TSB_INTIFSD_IDLEINT_130_INT130NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_130,5)))
#define TSB_INTIFSD_IDLEINT_130_INT130PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_130,6)))
#define TSB_INTIFSD_IDLEINT_130_INT130NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_130,7)))
#define TSB_INTIFSD_IDLEINT_131_INT131EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_131,0)))
#define TSB_INTIFSD_IDLEINT_131_INT131PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_131,4)))
#define TSB_INTIFSD_IDLEINT_131_INT131NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_131,5)))
#define TSB_INTIFSD_IDLEINT_131_INT131PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_131,6)))
#define TSB_INTIFSD_IDLEINT_131_INT131NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_131,7)))
#define TSB_INTIFSD_IDLEINT_132_INT132EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_132,0)))
#define TSB_INTIFSD_IDLEINT_132_INT132PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_132,4)))
#define TSB_INTIFSD_IDLEINT_132_INT132NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_132,5)))
#define TSB_INTIFSD_IDLEINT_132_INT132PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_132,6)))
#define TSB_INTIFSD_IDLEINT_132_INT132NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_132,7)))
#define TSB_INTIFSD_IDLEINT_133_INT133EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_133,0)))
#define TSB_INTIFSD_IDLEINT_133_INT133PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_133,4)))
#define TSB_INTIFSD_IDLEINT_133_INT133NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_133,5)))
#define TSB_INTIFSD_IDLEINT_133_INT133PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_133,6)))
#define TSB_INTIFSD_IDLEINT_133_INT133NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_133,7)))
#define TSB_INTIFSD_IDLEINT_134_INT134EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_134,0)))
#define TSB_INTIFSD_IDLEINT_134_INT134PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_134,4)))
#define TSB_INTIFSD_IDLEINT_134_INT134NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_134,5)))
#define TSB_INTIFSD_IDLEINT_134_INT134PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_134,6)))
#define TSB_INTIFSD_IDLEINT_134_INT134NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_134,7)))
