ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/device/TMPM066.h
#define TSB_INTIFSD_IDLEINT_135_INT135EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_135,0)))
#define TSB_INTIFSD_IDLEINT_135_INT135PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_135,4)))
#define TSB_INTIFSD_IDLEINT_135_INT135NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_135,5)))
#define TSB_INTIFSD_IDLEINT_135_INT135PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_135,6)))
#define TSB_INTIFSD_IDLEINT_135_INT135NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_135,7)))
#define TSB_INTIFSD_IDLEINT_136_INT136EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_136,0)))
#define TSB_INTIFSD_IDLEINT_136_INT136PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_136,4)))
#define TSB_INTIFSD_IDLEINT_136_INT136NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_136,5)))
#define TSB_INTIFSD_IDLEINT_136_INT136PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_136,6)))
#define TSB_INTIFSD_IDLEINT_136_INT136NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_136,7)))
#define TSB_INTIFSD_IDLEINT_137_INT137EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_137,0)))
#define TSB_INTIFSD_IDLEINT_137_INT137PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_137,4)))
#define TSB_INTIFSD_IDLEINT_137_INT137NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_137,5)))
#define TSB_INTIFSD_IDLEINT_137_INT137PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_137,6)))
#define TSB_INTIFSD_IDLEINT_137_INT137NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_137,7)))
#define TSB_INTIFSD_IDLEINT_138_INT138EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_138,0)))
#define TSB_INTIFSD_IDLEINT_138_INT138PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_138,4)))
#define TSB_INTIFSD_IDLEINT_138_INT138NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_138,5)))
#define TSB_INTIFSD_IDLEINT_138_INT138PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_138,6)))
#define TSB_INTIFSD_IDLEINT_138_INT138NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_138,7)))
#define TSB_INTIFSD_IDLEINT_139_INT139EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_139,0)))
#define TSB_INTIFSD_IDLEINT_139_INT139PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_139,4)))
#define TSB_INTIFSD_IDLEINT_139_INT139NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_139,5)))
#define TSB_INTIFSD_IDLEINT_139_INT139PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_139,6)))
#define TSB_INTIFSD_IDLEINT_139_INT139NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_139,7)))
#define TSB_INTIFSD_IDLEINT_140_INT140EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_140,0)))
#define TSB_INTIFSD_IDLEINT_140_INT140PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_140,4)))
#define TSB_INTIFSD_IDLEINT_140_INT140NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_140,5)))
#define TSB_INTIFSD_IDLEINT_140_INT140PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_140,6)))
#define TSB_INTIFSD_IDLEINT_140_INT140NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_140,7)))
#define TSB_INTIFSD_IDLEINT_141_INT141EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_141,0)))
#define TSB_INTIFSD_IDLEINT_141_INT141PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_141,4)))
#define TSB_INTIFSD_IDLEINT_141_INT141NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_141,5)))
#define TSB_INTIFSD_IDLEINT_141_INT141PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_141,6)))
#define TSB_INTIFSD_IDLEINT_141_INT141NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_141,7)))
#define TSB_INTIFSD_IDLEINT_142_INT142EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_142,0)))
#define TSB_INTIFSD_IDLEINT_142_INT142PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_142,4)))
#define TSB_INTIFSD_IDLEINT_142_INT142NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_142,5)))
#define TSB_INTIFSD_IDLEINT_142_INT142PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_142,6)))
#define TSB_INTIFSD_IDLEINT_142_INT142NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_142,7)))
#define TSB_INTIFSD_IDLEINT_143_INT143EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_143,0)))
#define TSB_INTIFSD_IDLEINT_143_INT143PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_143,4)))
#define TSB_INTIFSD_IDLEINT_143_INT143NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_143,5)))
#define TSB_INTIFSD_IDLEINT_143_INT143PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_143,6)))
#define TSB_INTIFSD_IDLEINT_143_INT143NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_143,7)))
#define TSB_INTIFSD_IDLEINT_144_INT144EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_144,0)))
#define TSB_INTIFSD_IDLEINT_144_INT144PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_144,4)))
#define TSB_INTIFSD_IDLEINT_144_INT144NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_144,5)))
#define TSB_INTIFSD_IDLEINT_144_INT144PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_144,6)))
#define TSB_INTIFSD_IDLEINT_144_INT144NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_144,7)))
#define TSB_INTIFSD_IDLEINT_145_INT145EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_145,0)))
#define TSB_INTIFSD_IDLEINT_145_INT145PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_145,4)))
#define TSB_INTIFSD_IDLEINT_145_INT145NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_145,5)))
#define TSB_INTIFSD_IDLEINT_145_INT145PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_145,6)))
#define TSB_INTIFSD_IDLEINT_145_INT145NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_145,7)))
#define TSB_INTIFSD_IDLEINT_146_INT146EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_146,0)))
#define TSB_INTIFSD_IDLEINT_146_INT146PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_146,4)))
#define TSB_INTIFSD_IDLEINT_146_INT146NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_146,5)))
#define TSB_INTIFSD_IDLEINT_146_INT146PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_146,6)))
#define TSB_INTIFSD_IDLEINT_146_INT146NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_146,7)))
#define TSB_INTIFSD_IDLEINT_147_INT147EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_147,0)))
#define TSB_INTIFSD_IDLEINT_147_INT147PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_147,4)))
#define TSB_INTIFSD_IDLEINT_147_INT147NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_147,5)))
#define TSB_INTIFSD_IDLEINT_147_INT147PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_147,6)))
#define TSB_INTIFSD_IDLEINT_147_INT147NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_147,7)))
#define TSB_INTIFSD_IDLEINT_148_INT148EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_148,0)))
#define TSB_INTIFSD_IDLEINT_148_INT148PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_148,4)))
#define TSB_INTIFSD_IDLEINT_148_INT148NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_148,5)))
#define TSB_INTIFSD_IDLEINT_148_INT148PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_148,6)))
#define TSB_INTIFSD_IDLEINT_148_INT148NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_148,7)))
#define TSB_INTIFSD_IDLEINT_149_INT149EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_149,0)))
#define TSB_INTIFSD_IDLEINT_149_INT149PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_149,4)))
#define TSB_INTIFSD_IDLEINT_149_INT149NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_149,5)))
#define TSB_INTIFSD_IDLEINT_149_INT149PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_149,6)))
#define TSB_INTIFSD_IDLEINT_149_INT149NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_149,7)))
#define TSB_INTIFSD_IDLEINT_150_INT150EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_150,0)))
#define TSB_INTIFSD_IDLEINT_150_INT150PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_150,4)))
#define TSB_INTIFSD_IDLEINT_150_INT150NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_150,5)))
#define TSB_INTIFSD_IDLEINT_150_INT150PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_150,6)))
#define TSB_INTIFSD_IDLEINT_150_INT150NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_150,7)))
#define TSB_INTIFSD_IDLEINT_151_INT151EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_151,0)))
#define TSB_INTIFSD_IDLEINT_151_INT151PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_151,4)))
#define TSB_INTIFSD_IDLEINT_151_INT151NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_151,5)))
#define TSB_INTIFSD_IDLEINT_151_INT151PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_151,6)))
#define TSB_INTIFSD_IDLEINT_151_INT151NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_151,7)))
#define TSB_INTIFSD_IDLEINT_152_INT152EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_152,0)))
#define TSB_INTIFSD_IDLEINT_152_INT152PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_152,4)))
#define TSB_INTIFSD_IDLEINT_152_INT152NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_152,5)))
#define TSB_INTIFSD_IDLEINT_152_INT152PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_152,6)))
#define TSB_INTIFSD_IDLEINT_152_INT152NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_152,7)))
#define TSB_INTIFSD_IDLEINT_153_INT153EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_153,0)))
#define TSB_INTIFSD_IDLEINT_153_INT153PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_153,4)))
#define TSB_INTIFSD_IDLEINT_153_INT153NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_153,5)))
#define TSB_INTIFSD_IDLEINT_153_INT153PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_153,6)))
#define TSB_INTIFSD_IDLEINT_153_INT153NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_153,7)))
#define TSB_INTIFSD_IDLEINT_154_INT154EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_154,0)))
#define TSB_INTIFSD_IDLEINT_154_INT154PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_154,4)))
#define TSB_INTIFSD_IDLEINT_154_INT154NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_154,5)))
#define TSB_INTIFSD_IDLEINT_154_INT154PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_154,6)))
#define TSB_INTIFSD_IDLEINT_154_INT154NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_154,7)))
#define TSB_INTIFSD_IDLEINT_155_INT155EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_155,0)))
#define TSB_INTIFSD_IDLEINT_155_INT155PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_155,4)))
#define TSB_INTIFSD_IDLEINT_155_INT155NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_155,5)))
#define TSB_INTIFSD_IDLEINT_155_INT155PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_155,6)))
#define TSB_INTIFSD_IDLEINT_155_INT155NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_155,7)))
#define TSB_INTIFSD_IDLEINT_156_INT156EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_156,0)))
#define TSB_INTIFSD_IDLEINT_156_INT156PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_156,4)))
#define TSB_INTIFSD_IDLEINT_156_INT156NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_156,5)))
#define TSB_INTIFSD_IDLEINT_156_INT156PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_156,6)))
#define TSB_INTIFSD_IDLEINT_156_INT156NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_156,7)))
#define TSB_INTIFSD_IDLEINT_157_INT157EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_157,0)))
#define TSB_INTIFSD_IDLEINT_157_INT157PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_157,4)))
#define TSB_INTIFSD_IDLEINT_157_INT157NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_157,5)))
#define TSB_INTIFSD_IDLEINT_157_INT157PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_157,6)))
#define TSB_INTIFSD_IDLEINT_157_INT157NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_157,7)))
#define TSB_INTIFSD_IDLEINT_158_INT158EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_158,0)))
#define TSB_INTIFSD_IDLEINT_158_INT158PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_158,4)))
#define TSB_INTIFSD_IDLEINT_158_INT158NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_158,5)))
#define TSB_INTIFSD_IDLEINT_158_INT158PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_158,6)))
#define TSB_INTIFSD_IDLEINT_158_INT158NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_158,7)))
#define TSB_INTIFSD_IDLEINT_159_INT159EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_159,0)))
#define TSB_INTIFSD_IDLEINT_159_INT159PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_159,4)))
#define TSB_INTIFSD_IDLEINT_159_INT159NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_159,5)))
#define TSB_INTIFSD_IDLEINT_159_INT159PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_159,6)))
#define TSB_INTIFSD_IDLEINT_159_INT159NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_159,7)))
#define TSB_INTIFSD_IDLEINT_160_INT160EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_160,0)))
#define TSB_INTIFSD_IDLEINT_160_INT160PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_160,4)))
#define TSB_INTIFSD_IDLEINT_160_INT160NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_160,5)))
#define TSB_INTIFSD_IDLEINT_160_INT160PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_160,6)))
#define TSB_INTIFSD_IDLEINT_160_INT160NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_160,7)))
#define TSB_INTIFSD_IDLEINT_161_INT161EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_161,0)))
#define TSB_INTIFSD_IDLEINT_161_INT161PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_161,4)))
#define TSB_INTIFSD_IDLEINT_161_INT161NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_161,5)))
#define TSB_INTIFSD_IDLEINT_161_INT161PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_161,6)))
#define TSB_INTIFSD_IDLEINT_161_INT161NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_161,7)))
#define TSB_INTIFSD_IDLEINT_162_INT162EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_162,0)))
#define TSB_INTIFSD_IDLEINT_162_INT162PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_162,4)))
#define TSB_INTIFSD_IDLEINT_162_INT162NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_162,5)))
#define TSB_INTIFSD_IDLEINT_162_INT162PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_162,6)))
#define TSB_INTIFSD_IDLEINT_162_INT162NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_162,7)))
#define TSB_INTIFSD_IDLEINT_163_INT163EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_163,0)))
#define TSB_INTIFSD_IDLEINT_163_INT163PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_163,4)))
#define TSB_INTIFSD_IDLEINT_163_INT163NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_163,5)))
#define TSB_INTIFSD_IDLEINT_163_INT163PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_163,6)))
#define TSB_INTIFSD_IDLEINT_163_INT163NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_163,7)))
#define TSB_INTIFSD_IDLEINT_164_INT164EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_164,0)))
#define TSB_INTIFSD_IDLEINT_164_INT164PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_164,4)))
#define TSB_INTIFSD_IDLEINT_164_INT164NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_164,5)))
#define TSB_INTIFSD_IDLEINT_164_INT164PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_164,6)))
#define TSB_INTIFSD_IDLEINT_164_INT164NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_164,7)))
#define TSB_INTIFSD_IDLEINT_165_INT165EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_165,0)))
#define TSB_INTIFSD_IDLEINT_165_INT165PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_165,4)))
#define TSB_INTIFSD_IDLEINT_165_INT165NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_165,5)))
#define TSB_INTIFSD_IDLEINT_165_INT165PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_165,6)))
#define TSB_INTIFSD_IDLEINT_165_INT165NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_165,7)))
#define TSB_INTIFSD_IDLEINT_166_INT166EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_166,0)))
#define TSB_INTIFSD_IDLEINT_166_INT166PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_166,4)))
#define TSB_INTIFSD_IDLEINT_166_INT166NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_166,5)))
#define TSB_INTIFSD_IDLEINT_166_INT166PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_166,6)))
#define TSB_INTIFSD_IDLEINT_166_INT166NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_166,7)))
#define TSB_INTIFSD_IDLEINT_167_INT167EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_167,0)))
#define TSB_INTIFSD_IDLEINT_167_INT167PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_167,4)))
#define TSB_INTIFSD_IDLEINT_167_INT167NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_167,5)))
#define TSB_INTIFSD_IDLEINT_167_INT167PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_167,6)))
#define TSB_INTIFSD_IDLEINT_167_INT167NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_167,7)))
#define TSB_INTIFSD_IDLEINT_168_INT168EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_168,0)))
#define TSB_INTIFSD_IDLEINT_168_INT168PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_168,4)))
#define TSB_INTIFSD_IDLEINT_168_INT168NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_168,5)))
#define TSB_INTIFSD_IDLEINT_168_INT168PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_168,6)))
#define TSB_INTIFSD_IDLEINT_168_INT168NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_168,7)))
#define TSB_INTIFSD_IDLEINT_169_INT169EN          (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_169,0)))
#define TSB_INTIFSD_IDLEINT_169_INT169PFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_169,4)))
#define TSB_INTIFSD_IDLEINT_169_INT169NFLG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_169,5)))
#define TSB_INTIFSD_IDLEINT_169_INT169PCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_169,6)))
#define TSB_INTIFSD_IDLEINT_169_INT169NCLR        (*((__IO uint32_t *)BITBAND_PERI(&TSB_INTIFSD->IDLEINT_169,7)))
#define TSB_INTIFSD_FLAG0_INT16FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG0,16)))
#define TSB_INTIFSD_FLAG0_INT17FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG0,17)))
#define TSB_INTIFSD_FLAG0_INT18FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG0,18)))
#define TSB_INTIFSD_FLAG1_INT32FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,0)))
#define TSB_INTIFSD_FLAG1_INT33FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,1)))
#define TSB_INTIFSD_FLAG1_INT34FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,2)))
#define TSB_INTIFSD_FLAG1_INT35FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,3)))
#define TSB_INTIFSD_FLAG1_INT36FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,4)))
#define TSB_INTIFSD_FLAG1_INT37FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,5)))
#define TSB_INTIFSD_FLAG1_INT38FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,6)))
#define TSB_INTIFSD_FLAG1_INT39FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG1,7)))
#define TSB_INTIFSD_FLAG3_INT96FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,0)))
#define TSB_INTIFSD_FLAG3_INT97FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,1)))
#define TSB_INTIFSD_FLAG3_INT98FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,2)))
#define TSB_INTIFSD_FLAG3_INT99FLG                (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,3)))
#define TSB_INTIFSD_FLAG3_INT100FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,4)))
#define TSB_INTIFSD_FLAG3_INT101FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,5)))
#define TSB_INTIFSD_FLAG3_INT102FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,6)))
#define TSB_INTIFSD_FLAG3_INT103FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,7)))
#define TSB_INTIFSD_FLAG3_INT104FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,8)))
#define TSB_INTIFSD_FLAG3_INT105FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,9)))
#define TSB_INTIFSD_FLAG3_INT106FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,10)))
#define TSB_INTIFSD_FLAG3_INT107FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,11)))
#define TSB_INTIFSD_FLAG3_INT108FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,12)))
#define TSB_INTIFSD_FLAG3_INT109FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,13)))
#define TSB_INTIFSD_FLAG3_INT110FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,14)))
#define TSB_INTIFSD_FLAG3_INT111FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,15)))
#define TSB_INTIFSD_FLAG3_INT112FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,16)))
#define TSB_INTIFSD_FLAG3_INT113FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,17)))
#define TSB_INTIFSD_FLAG3_INT114FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,18)))
#define TSB_INTIFSD_FLAG3_INT115FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,19)))
#define TSB_INTIFSD_FLAG3_INT116FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,20)))
#define TSB_INTIFSD_FLAG3_INT117FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,21)))
#define TSB_INTIFSD_FLAG3_INT118FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,22)))
#define TSB_INTIFSD_FLAG3_INT119FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,23)))
#define TSB_INTIFSD_FLAG3_INT120FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,24)))
#define TSB_INTIFSD_FLAG3_INT121FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,25)))
