ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/device/TMPM066.h
#define TSB_INTIFSD_FLAG3_INT122FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,26)))
#define TSB_INTIFSD_FLAG3_INT123FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,27)))
#define TSB_INTIFSD_FLAG3_INT124FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,28)))
#define TSB_INTIFSD_FLAG3_INT125FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,29)))
#define TSB_INTIFSD_FLAG3_INT126FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,30)))
#define TSB_INTIFSD_FLAG3_INT127FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG3,31)))
#define TSB_INTIFSD_FLAG4_INT128FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,0)))
#define TSB_INTIFSD_FLAG4_INT129FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,1)))
#define TSB_INTIFSD_FLAG4_INT130FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,2)))
#define TSB_INTIFSD_FLAG4_INT131FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,3)))
#define TSB_INTIFSD_FLAG4_INT132FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,4)))
#define TSB_INTIFSD_FLAG4_INT133FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,5)))
#define TSB_INTIFSD_FLAG4_INT134FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,6)))
#define TSB_INTIFSD_FLAG4_INT135FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,7)))
#define TSB_INTIFSD_FLAG4_INT136FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,8)))
#define TSB_INTIFSD_FLAG4_INT137FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,9)))
#define TSB_INTIFSD_FLAG4_INT138FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,10)))
#define TSB_INTIFSD_FLAG4_INT139FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,11)))
#define TSB_INTIFSD_FLAG4_INT140FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,12)))
#define TSB_INTIFSD_FLAG4_INT141FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,13)))
#define TSB_INTIFSD_FLAG4_INT142FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,14)))
#define TSB_INTIFSD_FLAG4_INT143FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,15)))
#define TSB_INTIFSD_FLAG4_INT144FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,16)))
#define TSB_INTIFSD_FLAG4_INT145FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,17)))
#define TSB_INTIFSD_FLAG4_INT146FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,18)))
#define TSB_INTIFSD_FLAG4_INT147FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,19)))
#define TSB_INTIFSD_FLAG4_INT148FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,20)))
#define TSB_INTIFSD_FLAG4_INT149FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,21)))
#define TSB_INTIFSD_FLAG4_INT150FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,22)))
#define TSB_INTIFSD_FLAG4_INT151FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,23)))
#define TSB_INTIFSD_FLAG4_INT152FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG4,24)))
#define TSB_INTIFSD_FLAG5_INT160FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,0)))
#define TSB_INTIFSD_FLAG5_INT161FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,1)))
#define TSB_INTIFSD_FLAG5_INT162FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,2)))
#define TSB_INTIFSD_FLAG5_INT163FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,3)))
#define TSB_INTIFSD_FLAG5_INT164FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,4)))
#define TSB_INTIFSD_FLAG5_INT165FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,5)))
#define TSB_INTIFSD_FLAG5_INT166FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,6)))
#define TSB_INTIFSD_FLAG5_INT167FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,7)))
#define TSB_INTIFSD_FLAG5_INT168FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,8)))
#define TSB_INTIFSD_FLAG5_INT169FLG               (*((__I  uint32_t *)BITBAND_PERI(&TSB_INTIFSD->FLAG5,9)))


/* ADC */
#define TSB_AD_MOD1_I2AD                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,6)))
#define TSB_AD_MOD1_VREFON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,7)))
#define TSB_AD_MOD3_ADOBSV0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,0)))
#define TSB_AD_MOD3_ADOBIC0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,5)))
#define TSB_AD_MOD4_ADHTG                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,4)))
#define TSB_AD_MOD4_ADHS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,5)))
#define TSB_AD_MOD4_HADHTG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,6)))
#define TSB_AD_MOD4_HADHS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD4,7)))
#define TSB_AD_MOD5_ADOBSV1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,0)))
#define TSB_AD_MOD5_ADOBIC1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,5)))
#define TSB_AD_MOD6_ADDMA                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,0)))
#define TSB_AD_MOD6_ADHPDMA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,1)))
#define TSB_AD_MOD6_ADM0DMA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,2)))
#define TSB_AD_MOD6_ADM1DMA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD6,3)))

/** @} *//* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif
#endif                          /* __TMPM066_H__ */

/** @} *//* End of group TMPM066 */
/** @} *//* End of group TOSHIBA_TX00_MICROCONTROLLER */
